Repository: rodakalex/Screenshot-translator
Catalog: libretranslate/libretranslate/locales/*/LC_MESSAGES/messages.po
Languages: bg

source: Invalid JSON format
bg: Невалиден JSON формат

source: Auto Detect
bg: Разпознаване

source: Unauthorized
bg: Неоторизиран

source: Too many request limits violations
bg: Твърде много нарушения на ограниченията на заявките

source: Invalid API key
bg: Невалиден API ключ

source: Please contact the server operator to get an API key
bg: Моля, свържете се с оператора на сървъра, за да получите API ключ

source: Visit %(url)s to get an API key
bg: Посетете %(url)s, за да получите API ключ

source: Slowdown:
bg: Забавяне:

source: Invalid request: missing %(name)s parameter
bg: Невалидна заявка: липсващ %(name)s параметър

source: Invalid request: request (%(size)s) exceeds text limit (%(limit)s)
bg: Невалидна заявка: заявката (%(size)s) надвишава ограничението за текст (%(limit)s)

source: %(lang)s is not supported
bg: %(lang)s не се поддържа

source: %(format)s format is not supported
bg: Форматът %(format)s не се поддържа

source: %(tname)s (%(tcode)s) is not available as a target language from %(sname)s (%(scode)s)
bg: %(tname)s (%(tcode)s) не е наличен като целеви език от %(sname)s (%(scode)s)

source: Cannot translate text: %(text)s
bg: Не може да се преведе текстът: %(text)s

source: Files translation are disabled on this server.
bg: Превеждането на файлове е изключено на този сървър.

source: Invalid request: empty file
bg: Невалидна заявка: празен файл

source: Invalid request: file format not supported
bg: Невалидна заявка: файловият формат не се поддържа

source: Invalid filename
bg: Невалидно име на файла

source: Suggestions are disabled on this server.
bg: Предложенията са изключени на този сървър.

source: English
bg: Английски

source: Arabic
bg: Арабски

source: Azerbaijani
bg: Азербайджански

source: Chinese
bg: Китайски

source: Czech
bg: Чешки

source: Danish
bg: Датски

source: Dutch
bg: Нидерландски

source: Esperanto
bg: Есперанто

source: Finnish
bg: Финландски

source: French
bg: Френски

source: German
bg: Немски

source: Greek
bg: Гръцки

source: Hebrew
bg: Иврит

source: Hindi
bg: Хинди

source: Hungarian
bg: Унгарски

source: Indonesian
bg: Индонезийски

source: Irish
bg: Ирландски

source: Italian
bg: Италиански

source: Japanese
bg: Японски

source: Korean
bg: Корейски

source: Persian
bg: Персийски

source: Polish
bg: Полски

source: Portuguese
bg: Португалски

source: Russian
bg: Руски

source: Slovak
bg: Словашки

source: Spanish
bg: Испански

source: Swedish
bg: Шведски

source: Turkish
bg: Турски

source: Ukranian
bg: Украински

source: Vietnamese
bg: Виетнамски

source: Retrieve list of supported languages
bg: Извличане на списък с поддържани езици

source: List of languages
bg: Списък с езици

source: translate
bg: превеждане

source: Translate text from a language to another
bg: Превеждане на текст от един език на друг

source: Translated text
bg: Преведен текст

source: Invalid request
bg: Невалидна заявка

source: Translation error
bg: Грешка при превода

source: Slow down
bg: Забавяне

source: Banned
bg: Блокиран

source: Hello world!
bg: Здравей, свят!

source: Text(s) to translate
bg: Текст(ове) за превод

source: Source language code
bg: Код на изходния език

source: Target language code
bg: Код на целевия език

source: Format of source text: * `text` - Plain text * `html` - HTML markup
bg: Формат на изходния текст: * `text` - Plain text * `html` - HTML markup

source: API key
bg: API ключ

source: Translate file from a language to another
bg: Превеждане на файл от един език на друг

source: Translated file
bg: Преведен файл

source: File to translate
bg: Файл за превод

source: Detect the language of a single text
bg: Разпознаване на езика на единичен текст

source: Detections
bg: Разпознавания

source: Detection error
bg: Грешка при разпознаване

source: Text to detect
bg: Текст за разпознаване

source: Retrieve frontend specific settings
bg: Извличане на специфични за клиентска част настройки

source: frontend settings
bg: настройки на клиентската част

source: frontend
bg: клиентска част

source: Submit a suggestion to improve a translation
bg: Изпрати предложение за подобряване на превода

source: Success
bg: Успех

source: Not authorized
bg: Не оторизиран

source: Original text
bg: Оригинален текст

source: Suggested translation
bg: Предложен превод

source: Language of original text
bg: Език на оригиналния текст

source: Language of suggested translation
bg: Език на предложения превод

source: feedback
bg: обратна връзка

source: Language code
bg: Езиков код

source: Human-readable language name (in English)
bg: Човекоразбираемо име на езика (на английски)

source: Supported target language codes
bg: Поддържани целеви езикови кодове

source: Translated text(s)
bg: Преведен(и) текст(ове)

source: Error message
bg: Съобщение за грешка

source: Reason for slow down
bg: Причина за забавяне

source: Translated file url
bg: Адрес на преведен файл

source: Confidence value
bg: Стойност на увереност

source: Character input limit for this language (-1 indicates no limit)
bg: Ограничение за въвеждане на символи за този език (-1 означава, че няма ограничение)

source: Frontend translation timeout
bg: Време за изчакване на превода през клиентската част

source: Whether the API key database is enabled.
bg: Дали базата данни с API ключове е включена.

source: Whether an API key is required.
bg: Дали API ключ е задължителен.

source: Whether submitting suggestions is enabled.
bg: Дали изпращането на предложения е включено.

source: Supported files format
bg: Поддържан файлов формат

source: Whether submission was successful
bg: Дали подаването е било успешно

source: Copy text
bg: Копиране на текста

source: Cannot load %(url)s
bg: Не може да се зареди %(url)s

source: Unknown error
bg: Неизвестна грешка

source: Copied
bg: Копиран

source: Thanks for your correction. Note the suggestion will not take effect right away.
bg: Благодарности за поправката. Имайте предвид, че предложението няма да влезе в сила веднага.

source: No languages available. Did you install the models correctly?
bg: Няма налични езици. Правилно ли инсталирахте моделите?

source: Type in your API Key. If you need an API key, %(instructions)s
bg: Въведете своя API ключ. Ако имате нужда от API ключ, %(instructions)s

source: press the "Get API Key" link.
bg: натиснете връзката „Получаване на API ключ“.

source: contact the server operator.
bg: свържете се с оператора на сървъра.

source: Free and Open Source Machine Translation API
bg: Свободен API с отворен код за машинен превод

source: Free and Open Source Machine Translation API. Self-hosted, offline capable and easy to setup. Run your own API server in just a few minutes.
bg: Свободен API с отворен код за машинен превод. Самостоятелен хостинг, офлайн способност и лесен за настройка. Стартирайте свой собствен API сървър само за няколко минути.

source: translation
bg: превод

source: API Docs
bg: API Документация

source: Get API Key
bg: Получаване на API ключ

source: Set API Key
bg: Задаване на API ключ

source: Change language
bg: Промяна на езика

source: Edit
bg: Редактиране

source: Toggle dark/light mode
bg: Превключване на тъмен/светъл режим

source: Dismiss
bg: Отхвърляне

source: Translation API
bg: API за превеждане

source: Translate Text
bg: Превод на текст

source: Translate Files
bg: Превод на файлове

source: Translate from
bg: Превеждане от

source: Swap source and target languages
bg: Размяна на изходния и целевия език

source: Translate into
bg: Превеждане на

source: Text to translate
bg: Текст за превод

source: Delete text
bg: Изтриване на текста

source: Suggest translation
bg: Предлагане на превод

source: Cancel
bg: Отказ

source: Send
bg: Изпращане

source: Supported file formats:
bg: Поддържани файлови формати:

source: File
bg: Файл

source: Remove file
bg: Премахване на файла

source: Translate
bg: Превеждане

source: Download
bg: Изтегляне

source: Request
bg: Заявка

source: Response
bg: Отговор

source: Open Source Machine Translation API
bg: API с отворен код за машинен превод

source: Self-Hosted. Offline Capable. Easy to Setup.
bg: Самостоятелен хостинг. Офлайн способност. Лесен за настройка.

source: License:
bg: Лицензия:

source: This public API should be used for testing, personal or infrequent use. If you're going to run an application in production, please %(host_server)s or %(get_api_key)s.
bg: Този публичен API трябва да се използва за тестване, лична или рядка употреба. Ако възнамерявате да стартирате приложение в продукция, моля %(host_server)s или %(get_api_key)s.

source: host your own server
bg: хоствайте свой собствен сървър

source: get an API key
bg: получаване на API ключ

source: Made with %(heart)s by %(contributors)s and powered by %(engine)s
bg: Направено с %(heart)s от %(contributors)s и задвижвано от %(engine)s

source: %(libretranslate)s Contributors
bg: %(libretranslate)s Сътрудници
